Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 cropping2d (Cropping2D)     (None, 160, 250, 3)       0         
                                                                 
 lambda (Lambda)             (None, 160, 250, 3)       0         
                                                                 
 conv2d (Conv2D)             (None, 53, 83, 32)        896       
                                                                 
 activation (Activation)     (None, 53, 83, 32)        0         
                                                                 
 conv2d_1 (Conv2D)           (None, 17, 27, 32)        9248      
                                                                 
 activation_1 (Activation)   (None, 17, 27, 32)        0         
                                                                 
 flatten (Flatten)           (None, 14688)             0         
                                                                 
 dense (Dense)               (None, 128)               1880192   
                                                                 
 activation_2 (Activation)   (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 4)                 516       
                                                                 
=================================================================
Total params: 1890852 (7.21 MB)
Trainable params: 1890852 (7.21 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
None

1/3 [=========>....................] - ETA: 0s - loss: 0.3126
3/3 [==============================] - 0s 55ms/step - loss: 3.0486 - val_loss: 0.6692
