Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(32, 5, 54)]             0         
                                                                 
 lstm (LSTM)                 (32, 5, 20)               6000      
                                                                 
 flatten (Flatten)           (32, 100)                 0         
                                                                 
 dense (Dense)               (32, 54)                  5454      
                                                                 
=================================================================
Total params: 11454 (44.74 KB)
Trainable params: 11454 (44.74 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Epoch: 0

  1/280 [..............................] - ETA: 2:27 - loss: 0.5937
 27/280 [=>............................] - ETA: 0s - loss: 0.5167  
 73/280 [======>.......................] - ETA: 0s - loss: 0.4990
121/280 [===========>..................] - ETA: 0s - loss: 0.4996
170/280 [=================>............] - ETA: 0s - loss: 0.5010
218/280 [======================>.......] - ETA: 0s - loss: 0.4992
265/280 [===========================>..] - ETA: 0s - loss: 0.4970
280/280 [==============================] - 1s 1ms/step - loss: 0.4978
