Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(32, 5, 54)]             0         
                                                                 
 lstm (LSTM)                 (32, 5, 20)               6000      
                                                                 
 flatten (Flatten)           (32, 100)                 0         
                                                                 
 dense (Dense)               (32, 54)                  5454      
                                                                 
=================================================================
Total params: 11454 (44.74 KB)
Trainable params: 11454 (44.74 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Epoch: 0

  1/280 [..............................] - ETA: 2:23 - loss: 0.5753
 32/280 [==>...........................] - ETA: 0s - loss: 0.5389  
 80/280 [=======>......................] - ETA: 0s - loss: 0.5183
131/280 [=============>................] - ETA: 0s - loss: 0.5120
181/280 [==================>...........] - ETA: 0s - loss: 0.5086
232/280 [=======================>......] - ETA: 0s - loss: 0.5083
279/280 [============================>.] - ETA: 0s - loss: 0.5073
280/280 [==============================] - 1s 1ms/step - loss: 0.5073
