Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(32, 5, 54)]             0         
                                                                 
 lstm (LSTM)                 (32, 5, 20)               6000      
                                                                 
 flatten (Flatten)           (32, 100)                 0         
                                                                 
 dense (Dense)               (32, 54)                  5454      
                                                                 
=================================================================
Total params: 11454 (44.74 KB)
Trainable params: 11454 (44.74 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Epoch: 0

  1/280 [..............................] - ETA: 2:34 - loss: 0.5502
 36/280 [==>...........................] - ETA: 0s - loss: 0.5267  
 83/280 [=======>......................] - ETA: 0s - loss: 0.5139
132/280 [=============>................] - ETA: 0s - loss: 0.5091
181/280 [==================>...........] - ETA: 0s - loss: 0.5072
227/280 [=======================>......] - ETA: 0s - loss: 0.5056
275/280 [============================>.] - ETA: 0s - loss: 0.5055
280/280 [==============================] - 1s 1ms/step - loss: 0.5054
