Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(32, 5, 54)]             0         
                                                                 
 lstm (LSTM)                 (32, 5, 20)               6000      
                                                                 
 flatten (Flatten)           (32, 100)                 0         
                                                                 
 dense (Dense)               (32, 54)                  5454      
                                                                 
=================================================================
Total params: 11454 (44.74 KB)
Trainable params: 11454 (44.74 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Epoch: 0

  1/280 [..............................] - ETA: 2:22 - loss: 0.7572
 34/280 [==>...........................] - ETA: 0s - loss: 0.5337  
 82/280 [=======>......................] - ETA: 0s - loss: 0.5123
133/280 [=============>................] - ETA: 0s - loss: 0.5072
184/280 [==================>...........] - ETA: 0s - loss: 0.5052
236/280 [========================>.....] - ETA: 0s - loss: 0.5040
280/280 [==============================] - 1s 1ms/step - loss: 0.5028
