Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense (Dense)               (None, 8)                 72        
                                                                 
 dense_1 (Dense)             (None, 128)               1152      
                                                                 
 dense_2 (Dense)             (None, 256)               33024     
                                                                 
 dense_3 (Dense)             (None, 512)               131584    
                                                                 
 dense_4 (Dense)             (None, 14)                7182      
                                                                 
=================================================================
Total params: 173014 (675.84 KB)
Trainable params: 173014 (675.84 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

1/1 [==============================] - ETA: 0s - loss: 2.6843
1/1 [==============================] - 0s 152ms/step - loss: 2.6843
