Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 64, 64, 64)        1088      
                                                                 
 conv2d_1 (Conv2D)           (None, 32, 32, 64)        65600     
                                                                 
 dropout (Dropout)           (None, 32, 32, 64)        0         
                                                                 
 conv2d_2 (Conv2D)           (None, 32, 32, 128)       131200    
                                                                 
 conv2d_3 (Conv2D)           (None, 16, 16, 128)       262272    
                                                                 
 dropout_1 (Dropout)         (None, 16, 16, 128)       0         
                                                                 
 conv2d_4 (Conv2D)           (None, 16, 16, 256)       524544    
                                                                 
 conv2d_5 (Conv2D)           (None, 8, 8, 256)         1048832   
                                                                 
 flatten (Flatten)           (None, 16384)             0         
                                                                 
 dropout_2 (Dropout)         (None, 16384)             0         
                                                                 
 dense (Dense)               (None, 512)               8389120   
                                                                 
 dense_1 (Dense)             (None, 24)                12312     
                                                                 
=================================================================
Total params: 10434968 (39.81 MB)
Trainable params: 10434968 (39.81 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
None

1/2 [==============>...............] - ETA: 0s - loss: 3.1806 - accuracy: 0.0156
2/2 [==============================] - ETA: 0s - loss: 3.1954 - accuracy: 0.0469
2/2 [==============================] - 2s 1s/step - loss: 3.1954 - accuracy: 0.0469 - val_loss: 3.1722 - val_accuracy: 0.0781
