(7, 100, 100, 3)
(7, 2)
done
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 98, 98, 32)        896       
                                                                 
 max_pooling2d (MaxPooling2  (None, 49, 49, 32)        0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 49, 49, 64)        2112      
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 24, 24, 64)        0         
 g2D)                                                            
                                                                 
 conv2d_2 (Conv2D)           (None, 24, 24, 128)       8320      
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 12, 12, 128)       0         
 g2D)                                                            
                                                                 
 conv2d_3 (Conv2D)           (None, 12, 12, 256)       33024     
                                                                 
 max_pooling2d_3 (MaxPoolin  (None, 6, 6, 256)         0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 9216)              0         
                                                                 
 dense (Dense)               (None, 256)               2359552   
                                                                 
 dense_1 (Dense)             (None, 256)               65792     
                                                                 
 dropout (Dropout)           (None, 256)               0         
                                                                 
 dense_2 (Dense)             (None, 2)                 514       
                                                                 
=================================================================
Total params: 2470210 (9.42 MB)
Trainable params: 2470210 (9.42 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
[INFO] training network...

1/1 [==============================] - ETA: 0s - loss: 0.6893 - accuracy: 0.5000
1/1 [==============================] - 1s 980ms/step - loss: 0.6893 - accuracy: 0.5000 - val_loss: 1.1501 - val_accuracy: 0.0000e+00
