Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 20, 32)            15104     
                                                                 
 lstm_1 (LSTM)               (None, 20)                4240      
                                                                 
 dense (Dense)               (None, 3)                 63        
                                                                 
=================================================================
Total params: 19407 (75.81 KB)
Trainable params: 19407 (75.81 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Train...

1/4 [======>.......................] - ETA: 3s - loss: 1.0878 - accuracy: 0.3750
4/4 [==============================] - 2s 112ms/step - loss: 1.1342 - accuracy: 0.3200 - val_loss: 1.0960 - val_accuracy: 0.3000
