Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d (Conv1D)             (None, 826, 512)          2048      
                                                                 
 flatten (Flatten)           (None, 422912)            0         
                                                                 
 dense (Dense)               (None, 256)               108265728 
                                                                 
 dropout (Dropout)           (None, 256)               0         
                                                                 
 dense_1 (Dense)             (None, 23)                5911      
                                                                 
=================================================================
Total params: 108273687 (206.52 MB)
Trainable params: 108273687 (206.52 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
None

1/1 [==============================] - ETA: 0s - loss: 0.0000e+00 - accuracy: 1.0000
1/1 [==============================] - 1s 567ms/step - loss: 0.0000e+00 - accuracy: 1.0000
