Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 36s - loss: 113.3188 - accuracy: 0.1875
 15/235 [>.............................] - ETA: 0s - loss: 73.4230 - accuracy: 0.5896  
 31/235 [==>...........................] - ETA: 0s - loss: 40.6367 - accuracy: 0.7230
 47/235 [=====>........................] - ETA: 0s - loss: 30.2900 - accuracy: 0.7637
 62/235 [======>.......................] - ETA: 0s - loss: 24.9243 - accuracy: 0.7858
 77/235 [========>.....................] - ETA: 0s - loss: 21.1352 - accuracy: 0.8069
 92/235 [==========>...................] - ETA: 0s - loss: 18.3623 - accuracy: 0.8220
107/235 [============>.................] - ETA: 0s - loss: 16.4587 - accuracy: 0.8320
122/235 [==============>...............] - ETA: 0s - loss: 14.7904 - accuracy: 0.8421
137/235 [================>.............] - ETA: 0s - loss: 13.4601 - accuracy: 0.8504
152/235 [==================>...........] - ETA: 0s - loss: 12.3327 - accuracy: 0.8581
166/235 [====================>.........] - ETA: 0s - loss: 11.4668 - accuracy: 0.8638
180/235 [=====================>........] - ETA: 0s - loss: 10.7341 - accuracy: 0.8684
194/235 [=======================>......] - ETA: 0s - loss: 10.0730 - accuracy: 0.8728
207/235 [=========================>....] - ETA: 0s - loss: 9.5601 - accuracy: 0.8759 
221/235 [===========================>..] - ETA: 0s - loss: 9.0563 - accuracy: 0.8796
235/235 [==============================] - 1s 4ms/step - loss: 8.6096 - accuracy: 0.8833
