Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 37s - loss: 124.9794 - accuracy: 0.1094
 16/235 [=>............................] - ETA: 0s - loss: 62.6059 - accuracy: 0.6216  
 32/235 [===>..........................] - ETA: 0s - loss: 37.0280 - accuracy: 0.7203
 48/235 [=====>........................] - ETA: 0s - loss: 27.0267 - accuracy: 0.7659
 64/235 [=======>......................] - ETA: 0s - loss: 22.0200 - accuracy: 0.7905
 80/235 [=========>....................] - ETA: 0s - loss: 18.7136 - accuracy: 0.8089
 95/235 [===========>..................] - ETA: 0s - loss: 16.2395 - accuracy: 0.8253
109/235 [============>.................] - ETA: 0s - loss: 14.6660 - accuracy: 0.8351
124/235 [==============>...............] - ETA: 0s - loss: 13.2486 - accuracy: 0.8442
138/235 [================>.............] - ETA: 0s - loss: 12.1665 - accuracy: 0.8514
153/235 [==================>...........] - ETA: 0s - loss: 11.1969 - accuracy: 0.8577
168/235 [====================>.........] - ETA: 0s - loss: 10.3593 - accuracy: 0.8638
183/235 [======================>.......] - ETA: 0s - loss: 9.6438 - accuracy: 0.8692 
197/235 [========================>.....] - ETA: 0s - loss: 9.0734 - accuracy: 0.8732
212/235 [==========================>...] - ETA: 0s - loss: 8.5467 - accuracy: 0.8767
225/235 [===========================>..] - ETA: 0s - loss: 8.1356 - accuracy: 0.8796
235/235 [==============================] - 1s 3ms/step - loss: 7.8605 - accuracy: 0.8819
