Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 38s - loss: 121.1984 - accuracy: 0.0508
 15/235 [>.............................] - ETA: 0s - loss: 51.8661 - accuracy: 0.6268  
 31/235 [==>...........................] - ETA: 0s - loss: 30.4786 - accuracy: 0.7353
 44/235 [====>.........................] - ETA: 0s - loss: 24.2531 - accuracy: 0.7694
 60/235 [======>.......................] - ETA: 0s - loss: 19.6111 - accuracy: 0.7956
 74/235 [========>.....................] - ETA: 0s - loss: 16.8671 - accuracy: 0.8140
 86/235 [=========>....................] - ETA: 0s - loss: 15.0091 - accuracy: 0.8262
100/235 [===========>..................] - ETA: 0s - loss: 13.3697 - accuracy: 0.8377
115/235 [=============>................] - ETA: 0s - loss: 12.0012 - accuracy: 0.8480
130/235 [===============>..............] - ETA: 0s - loss: 10.9245 - accuracy: 0.8551
145/235 [=================>............] - ETA: 0s - loss: 10.0141 - accuracy: 0.8626
160/235 [===================>..........] - ETA: 0s - loss: 9.2369 - accuracy: 0.8686 
175/235 [=====================>........] - ETA: 0s - loss: 8.6106 - accuracy: 0.8729
189/235 [=======================>......] - ETA: 0s - loss: 8.0923 - accuracy: 0.8765
204/235 [=========================>....] - ETA: 0s - loss: 7.6106 - accuracy: 0.8809
219/235 [==========================>...] - ETA: 0s - loss: 7.1759 - accuracy: 0.8844
234/235 [============================>.] - ETA: 0s - loss: 6.8093 - accuracy: 0.8875
235/235 [==============================] - 1s 4ms/step - loss: 6.8004 - accuracy: 0.8876
