Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 38s - loss: 169.9010 - accuracy: 0.0469
 14/235 [>.............................] - ETA: 0s - loss: 66.0246 - accuracy: 0.6052  
 28/235 [==>...........................] - ETA: 0s - loss: 38.7540 - accuracy: 0.7123
 43/235 [====>.........................] - ETA: 0s - loss: 29.4992 - accuracy: 0.7504
 58/235 [======>.......................] - ETA: 0s - loss: 23.3234 - accuracy: 0.7860
 73/235 [========>.....................] - ETA: 0s - loss: 19.6836 - accuracy: 0.8053
 88/235 [==========>...................] - ETA: 0s - loss: 17.1803 - accuracy: 0.8209
102/235 [============>.................] - ETA: 0s - loss: 15.2800 - accuracy: 0.8335
113/235 [=============>................] - ETA: 0s - loss: 14.1671 - accuracy: 0.8395
127/235 [===============>..............] - ETA: 0s - loss: 12.9391 - accuracy: 0.8471
140/235 [================>.............] - ETA: 0s - loss: 11.9607 - accuracy: 0.8534
154/235 [==================>...........] - ETA: 0s - loss: 11.0499 - accuracy: 0.8602
169/235 [====================>.........] - ETA: 0s - loss: 10.2360 - accuracy: 0.8658
182/235 [======================>.......] - ETA: 0s - loss: 9.6266 - accuracy: 0.8700 
196/235 [========================>.....] - ETA: 0s - loss: 9.0441 - accuracy: 0.8743
211/235 [=========================>....] - ETA: 0s - loss: 8.5034 - accuracy: 0.8786
226/235 [===========================>..] - ETA: 0s - loss: 8.0202 - accuracy: 0.8819
235/235 [==============================] - 1s 4ms/step - loss: 7.7831 - accuracy: 0.8836
