Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 39s - loss: 100.8691 - accuracy: 0.1094
 16/235 [=>............................] - ETA: 0s - loss: 65.7111 - accuracy: 0.6414  
 31/235 [==>...........................] - ETA: 0s - loss: 41.5170 - accuracy: 0.7228
 44/235 [====>.........................] - ETA: 0s - loss: 31.4413 - accuracy: 0.7644
 59/235 [======>.......................] - ETA: 0s - loss: 25.4208 - accuracy: 0.7904
 74/235 [========>.....................] - ETA: 0s - loss: 21.8106 - accuracy: 0.8058
 90/235 [==========>...................] - ETA: 0s - loss: 18.9583 - accuracy: 0.8185
105/235 [============>.................] - ETA: 0s - loss: 16.7963 - accuracy: 0.8311
120/235 [==============>...............] - ETA: 0s - loss: 15.1372 - accuracy: 0.8402
135/235 [================>.............] - ETA: 0s - loss: 13.7425 - accuracy: 0.8487
150/235 [==================>...........] - ETA: 0s - loss: 12.6147 - accuracy: 0.8555
166/235 [====================>.........] - ETA: 0s - loss: 11.6401 - accuracy: 0.8618
181/235 [======================>.......] - ETA: 0s - loss: 10.8469 - accuracy: 0.8668
195/235 [=======================>......] - ETA: 0s - loss: 10.1930 - accuracy: 0.8714
209/235 [=========================>....] - ETA: 0s - loss: 9.6148 - accuracy: 0.8754 
222/235 [===========================>..] - ETA: 0s - loss: 9.1483 - accuracy: 0.8785
235/235 [==============================] - ETA: 0s - loss: 8.7292 - accuracy: 0.8818
235/235 [==============================] - 1s 4ms/step - loss: 8.7292 - accuracy: 0.8818
