Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 37s - loss: 118.3884 - accuracy: 0.0977
 16/235 [=>............................] - ETA: 0s - loss: 72.1948 - accuracy: 0.6213  
 32/235 [===>..........................] - ETA: 0s - loss: 43.3104 - accuracy: 0.7155
 48/235 [=====>........................] - ETA: 0s - loss: 32.6346 - accuracy: 0.7549
 64/235 [=======>......................] - ETA: 0s - loss: 26.0138 - accuracy: 0.7866
 80/235 [=========>....................] - ETA: 0s - loss: 22.2281 - accuracy: 0.8049
 96/235 [===========>..................] - ETA: 0s - loss: 19.2854 - accuracy: 0.8199
111/235 [=============>................] - ETA: 0s - loss: 17.2808 - accuracy: 0.8286
127/235 [===============>..............] - ETA: 0s - loss: 15.5333 - accuracy: 0.8392
143/235 [=================>............] - ETA: 0s - loss: 14.0796 - accuracy: 0.8482
159/235 [===================>..........] - ETA: 0s - loss: 12.9249 - accuracy: 0.8550
174/235 [=====================>........] - ETA: 0s - loss: 11.9452 - accuracy: 0.8620
189/235 [=======================>......] - ETA: 0s - loss: 11.1488 - accuracy: 0.8664
204/235 [=========================>....] - ETA: 0s - loss: 10.4428 - accuracy: 0.8709
219/235 [==========================>...] - ETA: 0s - loss: 9.8201 - accuracy: 0.8750 
234/235 [============================>.] - ETA: 0s - loss: 9.2735 - accuracy: 0.8790
235/235 [==============================] - 1s 3ms/step - loss: 9.2600 - accuracy: 0.8791
