Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 37s - loss: 154.4025 - accuracy: 0.1016
 15/235 [>.............................] - ETA: 0s - loss: 63.5653 - accuracy: 0.6273  
 31/235 [==>...........................] - ETA: 0s - loss: 35.1593 - accuracy: 0.7395
 47/235 [=====>........................] - ETA: 0s - loss: 26.9109 - accuracy: 0.7739
 63/235 [=======>......................] - ETA: 0s - loss: 21.9018 - accuracy: 0.7965
 78/235 [========>.....................] - ETA: 0s - loss: 18.6624 - accuracy: 0.8143
 93/235 [==========>...................] - ETA: 0s - loss: 16.3362 - accuracy: 0.8279
107/235 [============>.................] - ETA: 0s - loss: 14.7151 - accuracy: 0.8374
122/235 [==============>...............] - ETA: 0s - loss: 13.3307 - accuracy: 0.8462
137/235 [================>.............] - ETA: 0s - loss: 12.1425 - accuracy: 0.8542
152/235 [==================>...........] - ETA: 0s - loss: 11.1511 - accuracy: 0.8614
167/235 [====================>.........] - ETA: 0s - loss: 10.3106 - accuracy: 0.8669
181/235 [======================>.......] - ETA: 0s - loss: 9.6427 - accuracy: 0.8719 
196/235 [========================>.....] - ETA: 0s - loss: 9.0196 - accuracy: 0.8769
210/235 [=========================>....] - ETA: 0s - loss: 8.5048 - accuracy: 0.8810
222/235 [===========================>..] - ETA: 0s - loss: 8.1169 - accuracy: 0.8838
235/235 [==============================] - 1s 4ms/step - loss: 7.7502 - accuracy: 0.8867
