Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 38s - loss: 138.1230 - accuracy: 0.0781
 15/235 [>.............................] - ETA: 0s - loss: 63.3390 - accuracy: 0.6370  
 29/235 [==>...........................] - ETA: 0s - loss: 38.2842 - accuracy: 0.7284
 43/235 [====>.........................] - ETA: 0s - loss: 29.0909 - accuracy: 0.7642
 58/235 [======>.......................] - ETA: 0s - loss: 23.5926 - accuracy: 0.7897
 72/235 [========>.....................] - ETA: 0s - loss: 20.2189 - accuracy: 0.8075
 87/235 [==========>...................] - ETA: 0s - loss: 17.7415 - accuracy: 0.8191
102/235 [============>.................] - ETA: 0s - loss: 15.5882 - accuracy: 0.8328
116/235 [=============>................] - ETA: 0s - loss: 14.1617 - accuracy: 0.8415
130/235 [===============>..............] - ETA: 0s - loss: 12.9195 - accuracy: 0.8500
144/235 [=================>............] - ETA: 0s - loss: 11.9570 - accuracy: 0.8558
157/235 [===================>..........] - ETA: 0s - loss: 11.1368 - accuracy: 0.8618
170/235 [====================>.........] - ETA: 0s - loss: 10.4367 - accuracy: 0.8671
183/235 [======================>.......] - ETA: 0s - loss: 9.8235 - accuracy: 0.8711 
197/235 [========================>.....] - ETA: 0s - loss: 9.2470 - accuracy: 0.8753
210/235 [=========================>....] - ETA: 0s - loss: 8.7618 - accuracy: 0.8791
225/235 [===========================>..] - ETA: 0s - loss: 8.2881 - accuracy: 0.8823
235/235 [==============================] - 1s 4ms/step - loss: 8.0021 - accuracy: 0.8847
