Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 784)               0         
                                                                 
 dense (Dense)               (None, 512)               401920    
                                                                 
 dense_1 (Dense)             (None, 10)                5130      
                                                                 
=================================================================
Total params: 407050 (1.55 MB)
Trainable params: 407050 (1.55 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

  1/235 [..............................] - ETA: 36s - loss: 186.0050 - accuracy: 0.0781
 14/235 [>.............................] - ETA: 0s - loss: 85.8385 - accuracy: 0.5491  
 29/235 [==>...........................] - ETA: 0s - loss: 47.6464 - accuracy: 0.6874
 45/235 [====>.........................] - ETA: 0s - loss: 34.2056 - accuracy: 0.7417
 61/235 [======>.......................] - ETA: 0s - loss: 27.3391 - accuracy: 0.7722
 75/235 [========>.....................] - ETA: 0s - loss: 23.2868 - accuracy: 0.7953
 90/235 [==========>...................] - ETA: 0s - loss: 20.2838 - accuracy: 0.8113
105/235 [============>.................] - ETA: 0s - loss: 17.9693 - accuracy: 0.8238
121/235 [==============>...............] - ETA: 0s - loss: 16.1242 - accuracy: 0.8336
136/235 [================>.............] - ETA: 0s - loss: 14.6875 - accuracy: 0.8426
152/235 [==================>...........] - ETA: 0s - loss: 13.3869 - accuracy: 0.8506
167/235 [====================>.........] - ETA: 0s - loss: 12.3711 - accuracy: 0.8579
183/235 [======================>.......] - ETA: 0s - loss: 11.4360 - accuracy: 0.8648
199/235 [========================>.....] - ETA: 0s - loss: 10.6885 - accuracy: 0.8692
214/235 [==========================>...] - ETA: 0s - loss: 10.0665 - accuracy: 0.8733
230/235 [============================>.] - ETA: 0s - loss: 9.4801 - accuracy: 0.8777 
235/235 [==============================] - 1s 3ms/step - loss: 9.3279 - accuracy: 0.8788
