300
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 300)               0         
                                                                 
 dense (Dense)               (None, 150)               45150     
                                                                 
 dense_1 (Dense)             (None, 150)               22650     
                                                                 
 dense_2 (Dense)             (None, 1)                 151       
                                                                 
=================================================================
Total params: 67951 (265.43 KB)
Trainable params: 67951 (265.43 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Found 6 images belonging to 2 classes.
Found 2 images belonging to 2 classes.

1/3 [=========>....................] - ETA: 0s - loss: 0.7248 - binary_accuracy: 0.0000e+00
3/3 [==============================] - 0s 48ms/step - loss: 1.2738 - binary_accuracy: 0.3333 - val_loss: 0.0989 - val_binary_accuracy: 1.0000
