Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense (Dense)               (None, 32)                800       
                                                                 
 dense_1 (Dense)             (None, 1024)              33792     
                                                                 
 dense_2 (Dense)             (None, 512)               524800    
                                                                 
 dense_3 (Dense)             (None, 256)               131328    
                                                                 
 dense_4 (Dense)             (None, 128)               32896     
                                                                 
 dense_5 (Dense)             (None, 3)                 387       
                                                                 
 activation (Activation)     (None, 3)                 0         
                                                                 
=================================================================
Total params: 724003 (2.76 MB)
Trainable params: 724003 (2.76 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

 1/19 [>.............................] - ETA: 3s - loss: 1.0691 - accuracy: 0.4375
16/19 [========================>.....] - ETA: 0s - loss: 1.2700 - accuracy: 0.3164
19/19 [==============================] - 0s 9ms/step - loss: 1.2538 - accuracy: 0.3162 - val_loss: 1.1491 - val_accuracy: 0.2974
