Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 review_input (InputLayer)   [(None, 100)]             0         
                                                                 
 embedding (Embedding)       (None, 100, 100)          100000    
                                                                 
 flatten (Flatten)           (None, 10000)             0         
                                                                 
 dense (Dense)               (None, 100)               1000100   
                                                                 
 dense_1 (Dense)             (None, 32)                3232      
                                                                 
 dense_2 (Dense)             (None, 5)                 165       
                                                                 
=================================================================
Total params: 1103497 (4.21 MB)
Trainable params: 1103497 (4.21 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
None

1/2 [==============>...............] - ETA: 0s - loss: 1.8329 - acc: 0.1250
2/2 [==============================] - 1s 201ms/step - loss: 3.2417 - acc: 0.1719 - val_loss: 3.2728 - val_acc: 0.1562
