Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 embedding (Embedding)       (None, 100, 100)          10000     
                                                                 
 flatten (Flatten)           (None, 10000)             0         
                                                                 
 dense (Dense)               (None, 64)                640064    
                                                                 
 dense_1 (Dense)             (None, 16)                1040      
                                                                 
=================================================================
Total params: 651104 (2.48 MB)
Trainable params: 651104 (2.48 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

1/3 [=========>....................] - ETA: 0s - loss: 2.7836 - categorical_accuracy: 0.0938
3/3 [==============================] - 0s 41ms/step - loss: 2.9708 - categorical_accuracy: 0.0429 - val_loss: 2.7631 - val_categorical_accuracy: 0.0000e+00
